In [1]:
import numpy as np
import pandas as pd

<style>
h1 {
    font-size: 34px;
    color: #FFD700; /* gold */
    font-weight: bold;
}
h2 {
    font-size: 28px;
    color: #1E90FF; /* dodger blue */
    font-weight: bold;
}
h3 {
    font-size: 24px;
    color: #90EE90; /* light green */
    font-weight: bold;
}
</style>

In [12]:
import pandas as pd

# Sample DataFrame for groupby
data = {
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'Finance', 'HR', 'IT'],
    'Employee': ['John', 'Anna', 'Peter', 'Linda', 'Steve', 'Sophia', 'Mike', 'Bob'],
    'Salary': [50000, 60000, 55000, 65000, 52000, 58000, 51000, 62000],
    'Bonus': [5000, 6000, 5500, 6500, 5200, 5800, 5100, 6200]
}

df=pd.DataFrame(data)
df

  Department Employee  Salary  Bonus
0         HR     John   50000   5000
1         IT     Anna   60000   6000
2    Finance    Peter   55000   5500
3         IT    Linda   65000   6500
4         HR    Steve   52000   5200
5    Finance   Sophia   58000   5800
6         HR     Mike   51000   5100
7         IT      Bob   62000   6200

## Group by Department and calculate sum of sales
=> groupby -> creates an obj which we can't see
-> to categorical(Qualitative) data not to continuous data(Quantitative)

In [13]:
dept=df.groupby ('Department')
dept
for i,v in dept:
    print(i)
    print(v)

Finance
  Department Employee  Salary  Bonus
2    Finance    Peter   55000   5500
5    Finance   Sophia   58000   5800
HR
  Department Employee  Salary  Bonus
0         HR     John   50000   5000
4         HR    Steve   52000   5200
6         HR     Mike   51000   5100
IT
  Department Employee  Salary  Bonus
1         IT     Anna   60000   6000
3         IT    Linda   65000   6500
7         IT      Bob   62000   6200

In [14]:
dept=df.groupby ('Department') ['Salary'].sum()
dept

Department
Finance    113000
HR         153000
IT         187000
Name: Salary, dtype: int64

In [15]:
# Group by multiple columns
# Group by Employee and Department
cat=df.groupby(['Department','Employee']).sum()
cat

                     Salary  Bonus
Department Employee
Finance    Peter      55000   5500
           Sophia     58000   5800
HR         John       50000   5000
           Mike       51000   5100
           Steve      52000   5200
IT         Anna       60000   6000
           Bob        62000   6200
           Linda      65000   6500

# Aggregation 
=> mean
=> median
=> std.deviation
=> maximum

In [16]:
df['Salary'].mean()

np.float64(56625.0)

In [19]:
df['Salary'].agg(['sum','mean','median','std','min','max','count'])

sum       453000.000000
mean       56625.000000
median     56500.000000
std         5501.623137
min        50000.000000
max        65000.000000
count          8.000000
Name: Salary, dtype: float64